import re
# text = '$299'
# req = re.match('\$\d+', text)
# print(req.group())
# E_123 = "apple peinf $99,dali price is $10"
# req = re.match('.*(\$\d+).*(\$\d+)', E_123)
# print(req.group(1,2))
# print(req.groups())
# hel= re.sub('\$\d+',"0",E_123)
# print(hel)
html = '''
<p class="">架构师</p>
<p>岗位描述：</p>
<p>1、负责后端架构设计和开发，为高速增长的用户群（现有千万级别）提供优质顺畅的信息服务和产品体验； <br>2、主导设计内容爬取，索引，分发等系统技术架构，核心代码开发和系统调优；<br>3、参与制定代码规范、测试规范，建立起开发质量控制方法； <br>4、协助团队攻克技术难关，参与各专项技术调研，新技术引入等前瞻项目。</p>
<p>岗位要求：</p>
<p>1、本科及以上学历，计算机相关专业； <br>2、具有四年以上互联网产品后端系统架构设计和实现的相关经历；<br>3、掌握扎实的计算机基础知识；精通java或Python中至少一门语言；具有优秀的逻辑分析能力；</p>
<p>4、有强烈的求知欲，优秀的学习，沟通和合作能力。</p>
'''
req = re.sub('<.+?>',"",html)
